In [1]:
l=[100,200,300]
print(l)

[100, 200, 300]

In [3]:
l.sort(reverse=True)
print(l)

[300, 200, 100]

In [4]:
l1=l.copy()
print(l1)

[300, 200, 100]

In [12]:
l=[100,200,300]
print(l.count(5))

0

In [13]:
l=[2,45,5,6]
for i in l:
    if i%2==0:
        print(i,end=" ")

2 6

In [14]:
l=[2,45,5,6]
s=0
for i in l:
   s=s+i
print(s)

58

In [16]:

#wap tp print second max in a list
n = [10, 25, 4, 98, 45]
n.sort()
print("Second maximum is:", n[-2])

Second maximum is: 45

In [18]:
#wap to print prime no.s
n=int(input())
for i in range(1,n):
    for j in range(2,i):
        if i%j==0:
            print(i)

 10

4
6
6
8
8
9

In [20]:
n = int(input("Enter a number: "))
p = []  

for i in range(2, n + 1):
    for j in range(2, i):
        if i % j == 0:
            break
    else:
        p.append(i)   
print("Prime numbers are:", p)

Enter a number:  10

Prime numbers are: [2, 3, 5, 7]

In [21]:
#wap to print prime no.s
a = [23, 78, 45, 67, 71, 90]
for n in a:
    if n > 1:
        for i in range(2, n):
            if n % i == 0:
                break
        else:
            print(n)

23
67
71

In [22]:
s = "Hi12 Hello$ This@ is Nagul7"

for w in s.split():
    a = sum(c.isalpha() for c in w)
    d = sum(c.isdigit() for c in w)
    sp = len(w) - a - d
    print(f"{w}: alphabets={a}, digits={d}, special chars={sp}")

Hi12: alphabets=2, digits=2, special chars=0
Hello$: alphabets=5, digits=0, special chars=1
This@: alphabets=4, digits=0, special chars=1
is: alphabets=2, digits=0, special chars=0
Nagul7: alphabets=5, digits=1, special chars=0

In [5]:
import pandas as pd
uber_d=pd.read_csv("C://Users/Admin/Documents/Uber_Drives_2016.csv")
uber_d.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [27]:
print(uber_d.shape)

(1156, 7)

In [28]:
print(uber_d.info)
#shape of dataframe

<bound method DataFrame.info of            START_DATE*         END_DATE* CATEGORY*            START*  \
0       1/1/2016 21:11    1/1/2016 21:17  Business       Fort Pierce
1        1/2/2016 1:25     1/2/2016 1:37  Business       Fort Pierce
2       1/2/2016 20:25    1/2/2016 20:38  Business       Fort Pierce
3       1/5/2016 17:31    1/5/2016 17:45  Business       Fort Pierce
4       1/6/2016 14:42    1/6/2016 15:49  Business       Fort Pierce
...                ...               ...       ...               ...
1151  12/31/2016 13:24  12/31/2016 13:42  Business           Kar?chi
1152  12/31/2016 15:03  12/31/2016 15:38  Business  Unknown Location
1153  12/31/2016 21:32  12/31/2016 21:50  Business        Katunayake
1154  12/31/2016 22:08  12/31/2016 23:51  Business           Gampaha
1155            Totals               NaN       NaN               NaN

                 STOP*   MILES*         PURPOSE*
0          Fort Pierce      5.1   Meal/Entertain
1          Fort Pierce      5.0              NaN
2          Fort Pierce      4.8  Errand/Supplies
3          Fort Pierce      4.7          Meeting
4      West Palm Beach     63.7   Customer Visit
...                ...      ...              ...
1151  Unknown Location      3.9   Temporary Site
1152  Unknown Location     16.2          Meeting
1153           Gampaha      6.4   Temporary Site
1154         Ilukwatta     48.2   Temporary Site
1155               NaN  12204.7              NaN

[1156 rows x 7 columns]>

In [29]:
print(uber_d.describe)#describes about dataframe

<bound method NDFrame.describe of            START_DATE*         END_DATE* CATEGORY*            START*  \
0       1/1/2016 21:11    1/1/2016 21:17  Business       Fort Pierce
1        1/2/2016 1:25     1/2/2016 1:37  Business       Fort Pierce
2       1/2/2016 20:25    1/2/2016 20:38  Business       Fort Pierce
3       1/5/2016 17:31    1/5/2016 17:45  Business       Fort Pierce
4       1/6/2016 14:42    1/6/2016 15:49  Business       Fort Pierce
...                ...               ...       ...               ...
1151  12/31/2016 13:24  12/31/2016 13:42  Business           Kar?chi
1152  12/31/2016 15:03  12/31/2016 15:38  Business  Unknown Location
1153  12/31/2016 21:32  12/31/2016 21:50  Business        Katunayake
1154  12/31/2016 22:08  12/31/2016 23:51  Business           Gampaha
1155            Totals               NaN       NaN               NaN

                 STOP*   MILES*         PURPOSE*
0          Fort Pierce      5.1   Meal/Entertain
1          Fort Pierce      5.0              NaN
2          Fort Pierce      4.8  Errand/Supplies
3          Fort Pierce      4.7          Meeting
4      West Palm Beach     63.7   Customer Visit
...                ...      ...              ...
1151  Unknown Location      3.9   Temporary Site
1152  Unknown Location     16.2          Meeting
1153           Gampaha      6.4   Temporary Site
1154         Ilukwatta     48.2   Temporary Site
1155               NaN  12204.7              NaN

[1156 rows x 7 columns]>

In [30]:
print(uber_d.describe())

             MILES*
count   1156.000000
mean      21.115398
std      359.299007
min        0.500000
25%        2.900000
50%        6.000000
75%       10.400000
max    12204.700000

In [4]:
uber_d.loc[[1,2,3],['START*','STOP*','MILES*']]

        START*        STOP*  MILES*
1  Fort Pierce  Fort Pierce     5.0
2  Fort Pierce  Fort Pierce     4.8
3  Fort Pierce  Fort Pierce     4.7

In [7]:
temp=pd.DataFrame({'A':[1,2,3,4],'B':[10,20,30,40],'C':['2025-1-19','2025-1-21','2025-1-11','2025-1-22']})
temp

   A   B          C
0  1  10  2025-1-19
1  2  20  2025-1-21
2  3  30  2025-1-11
3  4  40  2025-1-22

In [9]:
temp.dtypes

A     int64
B     int64
C    object
dtype: object

In [10]:
temp['C']=pd.to_datetime(temp['C'])
temp.dtypes

A             int64
B             int64
C    datetime64[ns]
dtype: object

In [13]:
uber_d['START*']=pd.to_datetime(uber_d['START*'])
uber_d.dtypes

C:\Users\Admin\AppData\Local\Temp\ipykernel_33848\3263071386.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  uber_d['START*']=pd.to_datetime(uber_d['START*'])

DateParseError: Unknown datetime string format, unable to parse: Fort Pierce, at position 0

In [15]:
uber_d['START*'].value_counts()

START*
Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
                   ...
Krendle Woods         1
Fuquay-Varina         1
Wake Co.              1
Katunayake            1
Gampaha               1
Name: count, Length: 177, dtype: int64

In [17]:
temp['A']=temp['A'].astype(str)
temp.dtypes

A            object
B             int64
C    datetime64[ns]
dtype: object

In [23]:
temp1=pd.DataFrame({'A':[1,2,3,4],'B':[10,20,30,40],'C':['2025-1-19','2025-1-21','2025-1-11','2025-1-22']})
temp1['C']=pd.to_datetime(temp1['C'],format="%d-%m-%y", errors="coerce")
temp1.dtypes

A             int64
B             int64
C    datetime64[ns]
dtype: object

In [25]:
#boo
df2=uber_d.loc[uber_d['MILES*']>6,['MILES*']]          # if you need miles clumn whose values >6
df2

       MILES*
4        63.7
6         7.1
8         8.3
9        16.5
10       10.8
...       ...
1144     12.9
1152     16.2
1153      6.4
1154     48.2
1155  12204.7

[569 rows x 1 columns]

In [26]:
df3=uber_d.loc[uber_d['MILES*']>6]           # if you need all the columns where miles>6
df3

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit
6,1/6/2016 17:30,1/6/2016 17:35,Business,West Palm Beach,Palm Beach,7.1,Meeting
8,1/10/2016 8:05,1/10/2016 8:25,Business,Cary,Morrisville,8.3,Meeting
9,1/10/2016 12:17,1/10/2016 12:44,Business,Jamaica,New York,16.5,Customer Visit
10,1/10/2016 15:08,1/10/2016 15:51,Business,New York,Queens,10.8,Meeting
...,...,...,...,...,...,...,...
1144,12/29/2016 23:14,12/29/2016 23:47,Business,Unknown Location,Kar?chi,12.9,Meeting
1152,12/31/2016 15:03,12/31/2016 15:38,Business,Unknown Location,Unknown Location,16.2,Meeting
1153,12/31/2016 21:32,12/31/2016 21:50,Business,Katunayake,Gampaha,6.4,Temporary Site
1154,12/31/2016 22:08,12/31/2016 23:51,Business,Gampaha,Ilukwatta,48.2,Temporary Site
1155,Totals,NaN,NaN,NaN,NaN,12204.7,NaN

In [27]:
uber_d.loc[uber_d['START*']=="New York"]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
10,1/10/2016 15:08,1/10/2016 15:51,Business,New York,Queens,10.8,Meeting
22,1/12/2016 16:02,1/12/2016 17:00,Business,New York,Queens County,15.1,Meeting
106,2/14/2016 16:35,2/14/2016 17:02,Business,New York,Long Island City,13.0,Meeting
423,6/10/2016 15:19,6/10/2016 16:28,Business,New York,Jamaica,16.3,Meeting

In [29]:
uber_d.loc[uber_d['START*'].isin(["New York","Cary"])]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
7,1/7/2016 13:27,1/7/2016 13:33,Business,Cary,Cary,0.8,Meeting
8,1/10/2016 8:05,1/10/2016 8:25,Business,Cary,Morrisville,8.3,Meeting
10,1/10/2016 15:08,1/10/2016 15:51,Business,New York,Queens,10.8,Meeting
22,1/12/2016 16:02,1/12/2016 17:00,Business,New York,Queens County,15.1,Meeting
28,1/15/2016 11:43,1/15/2016 12:03,Business,Cary,Durham,10.4,Meal/Entertain
...,...,...,...,...,...,...,...
1049,12/13/2016 20:20,12/13/2016 20:29,Business,Cary,Cary,4.1,Meal/Entertain
1050,12/14/2016 16:52,12/14/2016 17:10,Business,Cary,Cary,3.4,NaN
1051,12/14/2016 17:22,12/14/2016 17:34,Business,Cary,Cary,3.3,NaN
1052,12/14/2016 17:50,12/14/2016 18:00,Business,Cary,Morrisville,3.0,Meal/Entertain
1054,12/15/2016 14:20,12/15/2016 14:54,Business,Cary,Morrisville,10.6,Meeting

In [31]:
uber_d.loc[uber_d['PURPOSE*'].isin(["Meal/Enterain","NaN"])]

Empty DataFrame
Columns: [START_DATE*, END_DATE*, CATEGORY*, START*, STOP*, MILES*, PURPOSE*]
Index: []

In [ ]:
import pandas as pd

# Load dataset
df = pd.read_csv("Uber.csv")

# Display number of rows and columns
print("Number of Rows and Columns:", df.shape)

# Show unique categories in CATEGORY column
print("\nUnique Categories in CATEGORY column:")
print(df['CATEGORY'].unique())

# Find how many null values are there in PURPOSE
print("\nNumber of Null Values in PURPOSE column:")
print(df['PURPOSE'].isnull().sum())

# Rename all columns to uppercase
df.columns = [col.upper() for col in df.columns]
print("\nColumns after renaming:")
print(df.columns)